In [8]:
import pandas as pd
df=pd.read_csv('http://bit.ly/cutomresreport')
df.head()

,store_id,customer_code,mapped_store_id,customer_cid,customer_name,tel
0,3,39567,0,3N39567,Cathrine Price PhD,(411)547-3571x155
1,3,10677,0,3N10677,Miss Taniyah Wuckert DDS,1-566-594-0642
2,3,7315,0,3N7315,Dr. Loren Windler DDS,018-227-8846x5532
3,3,51541,0,3N51541,Christa McClure,(163)289-5991
4,3,4284,0,3N4284,Kalene Carroll-Zboncak,499-920-9854x079

In [17]:
def cust_id():
    return df.customer_cid.index
cust_id()

RangeIndex(start=0, stop=16082, step=1)

In [25]:
df.iloc[1:3,:]

,store_id,customer_code,mapped_store_id,customer_cid,customer_name,tel
1,3,10677,0,3N10677,Miss Taniyah Wuckert DDS,1-566-594-0642
2,3,7315,0,3N7315,Dr. Loren Windler DDS,018-227-8846x5532

In [28]:
df.iloc[2,:3]

store_id              3
customer_code      7315
mapped_store_id       0
Name: 2, dtype: object

In [44]:
import pandas as pd
df1=pd.read_csv('http://bit.ly/2JKFn5Z')
df1.head()

,article_id,store_id,brand,brand_name,category,category_name,subcategory,subcategory_name
0,2,2,3598,top ramen,3543,noodles,3599,instant noodles
1,2,3,3598,top ramen,3543,noodles,3599,instant noodles
2,2,4,3598,top ramen,3543,noodles,3599,instant noodles
3,2,5,3598,top ramen,3543,noodles,3599,instant noodles
4,3,2,3598,top ramen,3543,noodles,3599,instant noodles

In [68]:
df1.isnull().sum()

article_id          0
store_id            0
brand               0
brand_name          0
category_name       0
subcategory         0
subcategory_name    0
dtype: int64

In [70]:
df1.drop('brand', axis=1, inplace=True)
df1.head()

   article_id  store_id brand_name category_name  subcategory subcategory_name
0           2         2  top ramen       noodles         3599  instant noodles
1           2         3  top ramen       noodles         3599  instant noodles
2           2         4  top ramen       noodles         3599  instant noodles
3           2         5  top ramen       noodles         3599  instant noodles
4           3         2  top ramen       noodles         3599  instant noodles

In [74]:
df1.drop('category_name', axis=1, inplace=True)
df1.tail()

       article_id  store_id brand_name  subcategory        subcategory_name
40523       26698         5      parle         4174  muffins cookies & rusk
40524       26701         2     nestle         3838               chocolate
40525       26701         3     nestle         3838               chocolate
40526       26701         4     nestle         3838               chocolate
40527       26701         5     nestle         3838               chocolate

In [75]:
df1.columns

Index(['article_id', 'store_id', 'brand_name', 'subcategory',
       'subcategory_name'],
      dtype='object')

In [76]:
df1.index

RangeIndex(start=0, stop=40528, step=1)